<?php

namespace Tests\DataFixtures\FuzzyKeyword;

class SourceStringsFixture
{
    public static function getTiny(): string
    {
        return 'Lorem Ipsum является стандартной на статьёй рыбалки на тему "рыбы" для текстов на
латинице с начала XVI века. Существует компания рога и копыта, производящая прикормку для <b>карасей</b>.
Рог изобилия является предсказатель "клева" и он описан в статье на тему рыбалки...';
    }

    public static function getLarge(): string
    {
        return 'В  период с 23 июня по 27 августа находился в служебной командировке в Рязанской и 
Тамбовской областях. Что бы не коротать вечера в гостиницах и не думать о том, как ловится рыба приятелями дома, взял с 
собой спининг. Легкая дамовская палка  (телескоп потому, что таскать с собой штекер в командировке не совсем удобно).
<p>Первый выход к воде состоялся в районе р.ц. Мичуринск (Тамбовская область), речка Лесной Воронеж. Следует отметить 
небольшую ширину русла  реки, 10-30 метров и, что при такой маленькой ширине русла, средняя глубина 3-4 метра, в 
некоторых местах глубины достигали 5-7 метров. 
<p>Вечером примерно в 7 часов  начал обследовать понравившийся мне плес. Испробовал за 1,5 часа все имеющиеся у меня 
твистеры, результат ноль. Поставил рапаловский воблер Fat Rap 5. Примерно через десять забросов последовала вялая 
поклевка. Дальнейшие забросы так же не привели к какому либо положительному результату. Примерно до 10 вечера 
перепробовал все приманки, результата никакого. Метрах в 70 от меня уселся дедок и исправно начал таскал плотвичку одну 
за одной. Подошел к нему поинтересовался, что еще здесь ловится. Дед сказал, что летом со спинингом у них ничего не 
ловится и что я затеял пустое дело. Вода слишком теплая, хищник неактивный. Грустно вздохнув я побрел в гостиницу.
<p>На следующий день после работы, зашел в местный магазинчик, купил поплавок, грузила, мелких крючков и переделал свой 
спин в поплавочную удочку. 
<p>Вечером опять пошел на реку, насадил червяка и терпеливо уселся ждатьJ Примерно за 20-30 минут ни одной поклевки. 
Вчерашний дед опять сидел у воды и таскал плотву. Подошел к нему и поинтересовался, на что ловит. Дед сказал, что на 
распаренную кукурузу и отсыпал мне полстакана. Сняв трупик червя с крючка, насадил разбухшую кукурузину. Забросил, 
мгновенно последовала поклевка, ура, первая рыба J  Плотвичка 100-150 грамм. После этого начал, как и дедок, таскать 
рыбку одну за одной, средний размер выловленных экземпляров составил 15-25 см, при весе 150-200 грамм.  Клев прекратился
 после захода солнца, отдав выловленную рыбу дедку (в гостинице все равно ее негде готовить) довольный пошел домой.
<p>Переехав в Рязанскую область сразу выяснил у местных, что и как здесь ловят предсказатель. Клева оказалось, что 
предсказатель "клева" хищник летом не ловится, как и в Тамбовской области, слишком большая температура воды, рыба вялая 
и неактивная. Поэтому до конца командировки я рыбачил только на поплавочную удочку. 
<p>Второй выход к воде состоялся в районе г. Ряжск, речка Ранова. Очень похожа на речку  Лесной Воронеж. Уже зная, что 
местная плотва обожает кукурузу, запасся банкой БОНДЮЭЛИ и с коллегой по работе пошел на речку. Результат, в общем был 
предсказуем, примерно за 2-3 часа было поймано 10-литровое ведро плотвы, которую опять пришлось раздавать местным. 
<p>Переехали в г. Кораблино. Вечером в гостинице беседовали с местным рыболовом (муж администраторши гостиницы) он 
посоветовал съездить к Пронскому водохранилищу, там водится крупная рыба. 
<p>Дождавшись выходных мы с коллегами (теперь уже четверо) погрузились в УАЗик и поехали к водохранилищу. Приехал туда 
увидели кучу народу в районе плотины, как оказалось ловить возле плотины можно, не нужно никаких лицензий, нельзя  
ловить только непосредственно с самой плотины. Насадив уже проверенную кукурузу начали таскать рыбу. Вот только не 
плотву а в основном карася. Карась не крупный весом до 300 грамм, изредка попадались особи покрупней, самый крупный 
оказался примерно на 700-800 гр. Попутно пробовали ловить, в водохранилище Сазана, его тоже оказалось много. 
Сазан устойчиво брал только на перловку, кукурузу он брал нехотя. Самый крупный выловленный экземпляр оказался 
на 1,5 кг. При нас местные мужики вытащили огромного Сазанища, когда взвесили оказалось его вес 15 кг. Выводили они его 
примерно  минут 30-40, и делали это втроем. Один подтягивал к берегу, двое других стояли в воде с подсками. 
Нам к сожалению ничего такого поймать не удалось.
<p>В общем до конца командировки теперь мы только туда рыбачить и ездили.';
    }
}
